# Pandas

## By Scott Parr

<a id="0"></a> <br>

# Contents  
 
 1. [Series](#1)
 1. [Pandas  Dictionaries](#2)
 1. [Creating Series](#3)
 1. [DataFrame](#4)
 1. [The Pandas Index](#5)
 1. [Operations on Data](#6)
 1. [Missing Data](#7)
 1. [MultiIndexing](#8)
 1. [Analysis: Concat and Append](#9)
 1. [Aggregations](#10)
 1. [GroupBy and Pivot Tables](#11)

Pandas is short for Panel Data

Here is there documentation website

pandas.pydata.org/docs/

<a id="1"></a> 

# 1. Series

Pandas is short for Panel Data

Here is there documentation website

pandas.pydata.org/docs/

Many of the examples in this notebook are from The Python Data Science Handbook by Jake Vanderplas, 

Panda Series : essentially a multi-dimensional array with heterogeneous data and/or missing data

A little different than NumPy arrays, the indices for pandas series are automatically printed out, as well as the data type, and look more like a spreadsheet than an array.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([.25, .5, .75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
print(data.values)

[0.25 0.5  0.75 1.  ]

In [4]:
print(data.index)

RangeIndex(start=0, stop=4, step=1)

In [5]:
print (data[1])

0.5

In [6]:
print(data[1:3])

1    0.50
2    0.75
dtype: float64

The primary difference btw Pandas Seires and NumPy array is the index

Indices in NumPy arrays are created, but not viewed or changed in the same ways as the Pandas Series

With pandas We can change the indicies to whatever we'd like

In [7]:
data =pd.Series([0.25, 0.5, 0.75, 1.0],
               index = ['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
data['b']

0.5

[back to top](#Contents)


<a id="2"></a> 
# 2. Pandas  Dictionaries

Python dictionaries map key-value pairs

Series can be thought of similarly, but the keys and values have specific types

This helps with efficiency, just like NumPy arrays vs. Python lists 

Dictionaries are created with curly brackets/braces and colons

In [9]:
population_dict = {'California': 38883833, 
                   'Texas': 238273474,
                   'New York': 38584594032,
                    'Florida': 58693923,
                    'Illinois': 48457282}
print(population_dict)

{'California': 38883833, 'Texas': 238273474, 'New York': 38584594032, 'Florida': 58693923, 'Illinois': 48457282}

In [10]:
population = pd.Series(population_dict)
population

California       38883833
Texas           238273474
New York      38584594032
Florida          58693923
Illinois         48457282
dtype: int64

In [11]:
population['California']

38883833

In [12]:
population[0]

38883833

There are advantages to Series, like slicing

In [14]:
population['Texas':'Florida']

Texas         238273474
New York    38584594032
Florida        58693923
dtype: int64

In [15]:
population[1:4]

Texas         238273474
New York    38584594032
Florida        58693923
dtype: int64

In [16]:
hsl = {'Denmark': 1,
        'Switzerland': 2,
        'Netherlands': 3,
        'Norway': 4,
        'Germany': 5,
        'Sweden': 6,
        'Australia': 7,
        'Canada': 8,
        'Finland': 9,
        'United States': 10}

In [17]:
hsl

{'Denmark': 1,
 'Switzerland': 2,
 'Netherlands': 3,
 'Norway': 4,
 'Germany': 5,
 'Sweden': 6,
 'Australia': 7,
 'Canada': 8,
 'Finland': 9,
 'United States': 10}

In [18]:
highstandliving = pd.Series(hsl)
highstandliving

Denmark           1
Switzerland       2
Netherlands       3
Norway            4
Germany           5
Sweden            6
Australia         7
Canada            8
Finland           9
United States    10
dtype: int64

In [19]:
number1 = highstandliving['Denmark']
number1

1

In [20]:
top5 = highstandliving['Denmark': 'Germany']
top5

Denmark        1
Switzerland    2
Netherlands    3
Norway         4
Germany        5
dtype: int64

[back to top](#Contents)


<a id="3"></a> 

# 3. Creating Series

series generally have the same form as numpy arrays

pd.Series(data, index = index)

where index is optional

data is very broad 

First, from an array

In [21]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [22]:
pd.Series(5, index = [100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [23]:
fam = np.array (['greg', 'heather', 'grace', 'abigail'])
fam

array(['greg', 'heather', 'grace', 'abigail'], dtype='<U7')

In [24]:
pd.Series(fam)

0       greg
1    heather
2      grace
3    abigail
dtype: object

In [25]:
num = np.array([2, 4, 5, 6])
num

array([2, 4, 5, 6])

In [26]:
num2 = pd.Series(num)
num2

0    2
1    4
2    5
3    6
dtype: int64

In [27]:
list1 = [1, 4, 5]
list2 = pd.Series(list1)
list2

0    1
1    4
2    5
dtype: int64

In [28]:
list1

[1, 4, 5]

[back to top](#Contents)


<a id="4"></a> 
# 4. DataFrame

while series are one-dimensional, DataFrames are two-dimensional

DataFrames are most like a traditional spreadsheet we've seen so far

In [29]:
population_dict

{'California': 38883833,
 'Texas': 238273474,
 'New York': 38584594032,
 'Florida': 58693923,
 'Illinois': 48457282}

In [30]:
population_dict = {'California': 38883833, 
                   'Texas': 238273474,
                   'New York': 38584594032,
                    'Florida': 58693923,
                    'Illinois': 48457282}

In [31]:
population = pd.Series(population_dict)
population

California       38883833
Texas           238273474
New York      38584594032
Florida          58693923
Illinois         48457282
dtype: int64

In [32]:
area_dict = {'California': 439568,'Texas': 698662, 'New York': 142587, 'Florida': 170312, 'Illinois': 149995
            }
area = pd.Series(area_dict)
area

California    439568
Texas         698662
New York      142587
Florida       170312
Illinois      149995
dtype: int64

In [33]:
states = pd.DataFrame({'pop': population,
                       'area': area})
states

                    pop    area
California     38883833  439568
Texas         238273474  698662
New York    38584594032  142587
Florida        58693923  170312
Illinois       48457282  149995

In [34]:
print(states.index)

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [35]:
print(states.columns)

Index(['pop', 'area'], dtype='object')

In [36]:
print(states['area'])

California    439568
Texas         698662
New York      142587
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [38]:
# but we can't index rows this way now

#states[0]

In [41]:
# or this way 

#states['California']

[back to top](#Contents)


<a id="5"></a> 

# 5.  The Pandas Index

The index is one of the things that sets Pandas apart

Series and DataFrame both utilize the index in unique ways 

In many ways the index is like an array, but has addtionally interesting qualities 

e.g. you can create an index as an object without additional informations

In [42]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [43]:
#indexing the index

ind[1]

3

In [45]:
# lots of info is stored in the index

print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

But they can be referred to as immutable because they can't be altered in the same ways as arrays

In [47]:
# this will cause an error

#ind[1]= 0

### Data Selection in DataFrames

just like with Series, DataFrame attributes can be accessed in multiple ways

In [48]:
pop = pd.Series({'California': 38883833, 
                   'Texas': 238273474,
                   'New York': 38584594032,
                    'Florida': 58693923,
                    'Illinois': 48457282})
area = pd.Series({'California': 439568,'Texas': 698662, 'New York': 142587, 'Florida': 170312, 'Illinois': 149995
            })

In [49]:
data = pd.DataFrame({'area': area, 'pop': pop})
data

              area          pop
California  439568     38883833
Texas       698662    238273474
New York    142587  38584594032
Florida     170312     58693923
Illinois    149995     48457282

### Traditional Indexing

In [50]:
data['area']

California    439568
Texas         698662
New York      142587
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [51]:
data['area']['California']

439568

In [52]:
# this does not work

#data[0]

### Multi-dimensional indexing

### .loc

.loc is label based

In [53]:
data.loc['California']

area      439568
pop     38883833
Name: California, dtype: int64

In [54]:
data.loc[:, 'area']

California    439568
Texas         698662
New York      142587
Florida       170312
Illinois      149995
Name: area, dtype: int64

You can enter:

a single label ( 'California')

a list or array [['a', 'b', 'c']]

a label with column names ['index name', 'column name']

a slice with labels ('a':'b')

a conditional statement

In [61]:
# single label


data.loc['California']

area      439568
pop     38883833
Name: California, dtype: int64

In [62]:
# list of labels


data.loc [['Texas', 'California']]

              area        pop
Texas       698662  238273474
California  439568   38883833

In [64]:
#a label with column names ['index name', 'column name']


data.loc['California', 'area']

439568

In [65]:
#a slice with labels ('a':'b')


data.loc['California' : 'Florida']

              area          pop
California  439568     38883833
Texas       698662    238273474
New York    142587  38584594032
Florida     170312     58693923

In [66]:
#a conditional statement 

data.loc[data['area'] > 40000]

              area          pop
California  439568     38883833
Texas       698662    238273474
New York    142587  38584594032
Florida     170312     58693923
Illinois    149995     48457282

### .iloc

.iloc is integer position based

In [69]:
data.iloc[0]

area      439568
pop     38883833
Name: California, dtype: int64

In [72]:
# same as above, but this syntax is more clear about what you are indexing

data.iloc[0, :]

area      439568
pop     38883833
Name: California, dtype: int64

In [70]:
data.iloc[0, 0]

439568

In [67]:
data.iloc[0:4,0]

California    439568
Texas         698662
New York      142587
Florida       170312
Name: area, dtype: int64

You can enter:

integer[5]

list/array of ints [1, 2, 6]

slice with ints [3:5]

In [73]:
data.iloc[[1, 3]]

           area        pop
Texas    698662  238273474
Florida  170312   58693923

In [74]:
data.iloc[2:4]

            area          pop
New York  142587  38584594032
Florida   170312     58693923

### Attributes

In [75]:
data['area']

California    439568
Texas         698662
New York      142587
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [76]:
data.area

California    439568
Texas         698662
New York      142587
Florida       170312
Illinois      149995
Name: area, dtype: int64

But the attribute-style will not always work

If the column names are the same as DataFrame methods, the attribute-style will access the method, not the column

Another reason to name things carefully

In [77]:
data.pop

<bound method DataFrame.pop of               area          pop
California  439568     38883833
Texas       698662    238273474
New York    142587  38584594032
Florida     170312     58693923
Illinois    149995     48457282>

In [79]:
# can't create new columns with attributes

#data.density = data.pop/data.area

In [81]:
data['density'] = data['pop']/data['area']
data

              area          pop        density
California  439568     38883833      88.459199
Texas       698662    238273474     341.042556
New York    142587  38584594032  270603.870142
Florida     170312     58693923     344.625881
Illinois    149995     48457282     323.059315

[back to top](#Contents)


<a id="6"></a> 
# 6. Operations on Data

NumPy ufuncs are legitimately good

Pandas largely adopts its opperations from NumPy 

However, bc Pandas' index is so important, ufuncs have been altered to keep index integrity: Pandas automatically aligns indicers when using ufuncs

In [82]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [83]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns = ['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [84]:
#When we use a ufunc, the indices are preserved

np.log(ser)

0    1.791759
1    1.098612
2    1.945910
3    1.386294
dtype: float64

In [85]:
np.log(df)

          A         B         C         D
0  1.791759  2.197225  0.693147  1.791759
1  1.945910  1.386294  1.098612  1.945910
2  1.945910  0.693147  1.609438  1.386294

### Index Alignment

more impressive and important is the alignment of indices across operations

In [86]:
area = pd.Series({'Alaska': 439568,'Texas': 698662, 'California': 142587}, name = 'area')


population = pd.Series({'California': 38883833, 
                   'Texas': 238273474,
                   'New York': 38584594032}, name = 'population')

In [87]:
print(area)
print()
print(population)

Alaska        439568
Texas         698662
California    142587
Name: area, dtype: int64

California       38883833
Texas           238273474
New York      38584594032
Name: population, dtype: int64

In [88]:
# Note, the states are not the same, AK and NY are unique to the DFs

population/area

Alaska               NaN
California    272.702511
New York             NaN
Texas         341.042556
dtype: float64

Note: NaN - Not a number. This is how missing data are handled in Python

Bc operations rely on indices, they're preserved

In [89]:
area.index | population.index

/var/folders/lk/9tx_0wrx6392n0ldjc955mz00000gn/T/ipykernel_24345/3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [90]:
A = pd.Series([2, 4, 6], index = [0, 1, 2])
print(A)
print()
B = pd.Series([1 ,3 ,5], index=[1, 2, 3])
print(B)
print()

A + B

0    2
1    4
2    6
dtype: int64

1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

There are a number of ways of dealing with missing data, but we'll get to that soon

This alignment continues for columns and indices

In [91]:
rng = np.random.RandomState(42)

A = pd.DataFrame(rng.randint(0, 20, (2,2)), 
                 columns = list('AB'))
print(A)
print()

B = pd.DataFrame(rng.randint(0, 10, (3,3)), 
                 columns = list('BAC'))

print(B)

    A   B
0   6  19
1  14  10

   B  A  C
0  7  4  6
1  9  2  6
2  7  4  3

In [92]:
# Note that despite the columns not being in order,  operations work as you would expect

A + B

      A     B   C
0  10.0  26.0 NaN
1  16.0  19.0 NaN
2   NaN   NaN NaN

### Operations between DataFrames and Series

Again, index and column alignment maintained

In [93]:
rng = np.random.RandomState(42)
A = rng.randint(10, size = (3, 4))
A

array([[6, 3, 7, 4],
       [6, 9, 2, 6],
       [7, 4, 3, 7]])

In [94]:
A-A[0]

array([[ 0,  0,  0,  0],
       [ 0,  6, -5,  2],
       [ 1,  1, -4,  3]])

In [95]:
df = pd.DataFrame(A, columns = list('QRST'))
df

   Q  R  S  T
0  6  3  7  4
1  6  9  2  6
2  7  4  3  7

In [96]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  0  6 -5  2
2  1  1 -4  3

In [97]:
df.subtract(df['R'], axis = 0)

   Q  R  S  T
0  3  0  4  1
1 -3  0 -7 -3
2  3  0 -1  3

[back to top](#Contents)


<a id="7"></a> 

# 7. Missing Data

Almost all realworld datasets have missing data

a key part of data analysis is determining how to deal with missing data

null, NaN, or NA values are how missing values are referred to in Python.

But Pandas and NumPy differ

We'll rely on Pandas' NaN for floats, and None for objects


## Two strategies: Masking and Sentinel Values

Masking: Have a different Boolean Array

Sentinel: Missing values are indicated by rare values like -9999, NaN(not a number), or other special values

Each have downsides:

    Masking requires a(n) addtional array(s)
    
    Sentinels add additional characters and therefore reduce range of valid values(e.g., -9999 couldn't be valid
    
    
## Missing data & Pandas

Pandas' sentinal values:

For numerical: NaN

For others : None (not none)

But None is type object, and should only be used in arrays of that type

In [98]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [99]:
vals2 = np.array([1, 2, 4])
vals2

array([1, 2, 4])

In [100]:
vals2.sum()

7

In [101]:
# this won't work

# vals1.sum()

### NaN: missing numberical data

Naan, or "Not a number" is used for numerical values

In [102]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [103]:
vals2.sum()

nan

In [104]:
1 + np.nan

nan

In [105]:
# We can use np.nan functions to run functions with missing values

np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

### NaN and None in Pandas

Pandas is built to deal with both None and NaN

If you use None, Pandas will alter it:

 1. From None to NaN
 
 2. From type int64 to float64

In [106]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [107]:
x = pd.Series(range(2), dtype = int)
x

0    0
1    1
dtype: int64

In [108]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

### Working with Null values 

Pandas treats None and NaN interchangeably

We can now find these missing values with the following:

    isnull(): Generates a boolean mask that indicates missing values
    
    notnull(): the opposite of above
    
    dropna(): Returns filtered data 
    
    fillna(): Returns copy of data with missing values filled 
    
### Detecting nulls

In [109]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [110]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [111]:
# This can be used as an index 

data[data.notnull()]

0        1
2    hello
dtype: object

In [112]:
# This works for Dfs, too

df = pd.DataFrame([[1,      None,      2],
                   [2,      3,         5],
                   [np.nan, 4,         6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [113]:
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [114]:
df.notnull()

       0      1     2
0   True  False  True
1   True   True  True
2  False   True  True

In [115]:
# Notice when you index the null values they dont get removed like they do in a series above


df[df.notnull()]

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

### Dropping Null Values
We can drop null values using dropna()

In [116]:
data = pd.Series([1, np.nan, 'hello', None])
data.dropna()

0        1
2    hello
dtype: object

In [117]:
# When dealing with DFs its more complicated 

df = pd.DataFrame([[1,      np.nan,      2],
                  [2,      3,           5],
                  [np.nan, 4,           6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

What would happen if we dropped any individual NaN?

Therefore, there are more options

In [118]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [119]:
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [120]:
# Let's add a column

df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [121]:
df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [128]:
df.dropna(axis = 'columns', thresh = 3) 
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

### Filling Null Values 


This topic is a bit more serious than he gives credit and a bit beyond our capacity

Just know for now that this is serious, and you need a theortically valid reason for how to fill nulls, if you do at all

In [123]:
data = pd.Series([1, np.nan, 2, None, 3], index = list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [130]:
data.fillna(55)

a     1.0
b    55.0
c     2.0
d    55.0
e     3.0
dtype: float64

In [131]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [129]:
df.fillna(method = 'ffill', axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

[back to top](#Contents)


<a id="8"></a> 


# 8.  MultiIndexing 

lets say we have population for states, but for different years

a bad way to do it would be the following:

In [132]:
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas',2010)]
populations = [2020234, 4934292, 4403023, 3440403, 4040502, 3939495]

pop = pd.Series(populations, index = index)
pop

(California, 2000)    2020234
(California, 2010)    4934292
(New York, 2000)      4403023
(New York, 2010)      3440403
(Texas, 2000)         4040502
(Texas, 2010)         3939495
dtype: int64

In [133]:
pop[('California', 2010):('New York', 2010)]

(California, 2010)    4934292
(New York, 2000)      4403023
(New York, 2010)      3440403
dtype: int64

because of indexing style you couldn't perhaps just look at California, or just the year 2010

So we multiIndex

In [134]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [135]:
# We can now reindex to update our index, and ta da!

pop=pop.reindex(index)
pop

California  2000    2020234
            2010    4934292
New York    2000    4403023
            2010    3440403
Texas       2000    4040502
            2010    3939495
dtype: int64

In [136]:
# Now we can index using state names, or years

pop['California']

2000    2020234
2010    4934292
dtype: int64

In [137]:
pop[:, 2010]

California    4934292
New York      3440403
Texas         3939495
dtype: int64

### stack and unstack

In [138]:
pop

California  2000    2020234
            2010    4934292
New York    2000    4403023
            2010    3440403
Texas       2000    4040502
            2010    3939495
dtype: int64

In [143]:
# turns series into dataframe

pop_df = pop.unstack()
pop_df

               2000     2010
California  2020234  4934292
New York    4403023  3440403
Texas       4040502  3939495

In [140]:
pop_df.stack()

California  2000    2020234
            2010    4934292
New York    2000    4403023
            2010    3440403
Texas       2000    4040502
            2010    3939495
dtype: int64

In [141]:
pop_df = pd.DataFrame({'total': pop,
                      'under18': [684935, 363849, 304957, 374950, 267849, 489458]})
pop_df

                   total  under18
California 2000  2020234   684935
           2010  4934292   363849
New York   2000  4403023   304957
           2010  3440403   374950
Texas      2000  4040502   267849
           2010  3939495   489458

In [142]:
# ufuncs work well too

f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.339037  0.073739
New York    0.069261  0.108984
Texas       0.066291  0.124244

In [144]:
df = pd.DataFrame(np.random.rand(4, 2),
                 index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns = ['data1', 'data2'])
df

        data1     data2
a 1  0.861710  0.726229
  2  0.026991  0.585364
b 1  0.175489  0.207525
  2  0.825969  0.600243

In [145]:
# You can change level names, too

pop.index.names = ['state', 'year']
pop

state       year
California  2000    2020234
            2010    4934292
New York    2000    4403023
            2010    3440403
Texas       2000    4040502
            2010    3939495
dtype: int64

### Hierarchical index for columns

In [146]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                  names = ['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido', 'Sue'], ['HR', 'Temp']],
                                    names = ['subject', 'type'])

data = np.round( np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  36.5  45.0  35.8  40.0  37.7
     2      60.0  37.8  19.0  37.6  32.0  38.8
2014 1      33.0  36.1  34.0  37.2  38.0  38.1
     2      33.0  38.1  42.0  37.7  43.0  35.6

In [147]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      45.0  35.8
     2      19.0  37.6
2014 1      34.0  37.2
     2      42.0  37.7

[back to top](#Contents)


<a id="9"></a> 

# 9. Analysis: Concat and Append

Previously we learned how to concatenate lists in NumPy

In [152]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [153]:
x = [[1, 2],
    [3, 4]]
np.concatenate([x, x])

array([[1, 2],
       [3, 4],
       [1, 2],
       [3, 4]])

In [154]:
x = [[1, 2],
    [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

### Expanding on this with Pandas

In [155]:
ser1 = pd.Series(['A', 'B', 'C'], index = [1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index = [4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

Pandas concat() expands on what we did with NumPy 

### Some new functions

There was a change in Python btwn when it was written and now

Instead of the option axis = 'col' you must use axis = 1

by default Pandas will concatenate objects in order taking second obj and placing it under first, unless you use axis = 1 in which case it will stack next to, not under

In [160]:


df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [161]:


df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', 'pd.concat([df3, df4], axis = 1)')

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis = 1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

### Exercise 1

Lets make two series with at least two values and two indices each

    the values can be of your choice
    the indices should be the names that those values belong to
    
then us pd.concat() to concatenate them

In [162]:
parents = pd.Series([33, 38], index = ['Greg', 'Heather'])
kids = pd.Series([5, 3], index = ['Grace', 'Abigail'])
pd.concat([parents, kids])

Greg       33
Heather    38
Grace       5
Abigail     3
dtype: int64

In [163]:
# But see what happens when there are duplicate indices 

years = pd.Series([21, 18], index = ['Greg', 'Heather'])
years2= pd.concat([parents, years])
years2

Greg       33
Heather    38
Greg       21
Heather    18
dtype: int64

In [164]:
years2['Greg']

Greg    33
Greg    21
dtype: int64

### Dealing with Duplicate Indices

Take a look at what happens when there are duplicate indicies

in x, y, and z, the index of each contains 0, 1, 2

In [165]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
print(x[0], y[0], z[0])

1 4 7

In [166]:
j = np.concatenate([x, y, z])
j

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [168]:
# previously 7 was indexed at [0], now its at [6]

j[6]

7

Concatenating changes the locations.  Now 4 is position 3, 7 is 6

the indicies are overwritten

this is different in Pandas

In [170]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

However, this is often not what we want

You generally don't want observations to have the same identifier, be it a name, i number, etc.

In [171]:
pd.concat([x, y])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

### Ignoring the index

There are many ways to deal with a conflict like this

We almost never want to ignore the index, so dont worry about that

However, sometimes you'll want to add a key

In [172]:
display('x', 'y', "pd.concat([x, y], keys = ['x', 'y'])")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], keys = ['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [173]:
pd.concat([parents, years], keys = ['Age', 'Years'])

Age    Greg       33
       Heather    38
Years  Greg       21
       Heather    18
dtype: int64

### Concatenation with Joins

Often we'll have some shared columns/variables, but some that aren't shared

Don't worry about inner and outer joins- you'll get to that in a database class

We'll focus on combining them differently 

This is another place whee the text needs an update: use sort = False here to avoid warning

In [174]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6], sort = False)')

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], sort = False)
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [177]:
parentdf = pd.DataFrame({'Age': parents, 'Years': years})
kiddf = pd.DataFrame({'Age': kids})


print(parentdf)
print()
print(kiddf)

         Age  Years
Greg      33     21
Heather   38     18

         Age
Grace      5
Abigail    3

In [176]:
pd.concat([parentdf, kiddf], sort = False)

         Age  Years
Greg      33   21.0
Heather   38   18.0
Grace      5    NaN
Abigail    3    NaN

Years became a float because NaN upcasts ints to floats

### Main takeaways:

When dataframes are concatenated, the indices are preserved

values that are not present are changed to NaN and data types are adjusted as well to floats


### Append() method

We can do what we've been doing using the append method

In [179]:
pd.concat([parentdf, kiddf], sort = True)

         Age  Years
Greg      33   21.0
Heather   38   18.0
Grace      5    NaN
Abigail    3    NaN

In [182]:
x = parentdf.append(kiddf)
x

/var/folders/lk/9tx_0wrx6392n0ldjc955mz00000gn/T/ipykernel_24345/199422338.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  x = parentdf.append(kiddf)

         Age  Years
Greg      33   21.0
Heather   38   18.0
Grace      5    NaN
Abigail    3    NaN

In [183]:
kiddf.append(parentdf)

/var/folders/lk/9tx_0wrx6392n0ldjc955mz00000gn/T/ipykernel_24345/553216968.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  kiddf.append(parentdf)

         Age  Years
Grace      5    NaN
Abigail    3    NaN
Greg      33   21.0
Heather   38   18.0

In [184]:
x['Years']

Greg       21.0
Heather    18.0
Grace       NaN
Abigail     NaN
Name: Years, dtype: float64

In [185]:
x['Years'][0]

21.0

[back to top](#Contents)


<a id="10"></a> 

# 10. Aggregations 

One of the first steps in data analysis is obtaining descriptive statistics

these are statistics that represent your data as a whole, so you're not concerned with any individual observations

the process of taking a data and produciong a single number to insight into some phenomenon is called aggregation

this is what occurs when you find statistics like:

        sum()
        
        mean()
        
        median()
        
        min()
        
First, we will make a basic random five-value Series

In [186]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [187]:
ser.sum()

2.811925491708157

In [188]:
ser.mean()

0.5623850983416314

In [189]:
# These functions can also work in DataFrames

df = pd.DataFrame({'A': rng.rand(5),
                  'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [190]:
df.sum()

A    2.389442
B    2.217101
dtype: float64

In [191]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

Because we know indices are so important, Pandas knows to produce the mean for each variable separately 

You can change the axis to alter how the calculation is done

In [192]:
df.mean(axis = 'columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

We can also use functions we discussed before

Pandas built the DataFrame to  seamlessly flow with these

In [193]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

This has informaiton on extrasolar planets or expoplanets

these are planets they have discovered around other stars

In [194]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [195]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

There are other aggregator methods like count(), first(), std(), prod(), among others


[back to top](#Contents)


<a id="11"></a> 

# 11. GroupBy and Pivot Tables


### GroupBy

Aggregators  are important, but often we need to go beyond simple aggregation

    instead of average height, you might want by men and women
    
    instead of finding average GPA, you might want it by major
    
    Instead of covid statistics you might want it by county or state
    
You can think of the following split, apply, combine diagram to understand what groupby does 


https://jakevdp.github.io/PythonDataScienceHandbook/figures/03.08-split-apply-combine.png![image.png](attachment:image.png)

In [196]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [197]:
df.groupby('key').max()

     data
key
A       3
B       4
C       5

In [198]:
df.groupby('key').mean()

     data
key
A     1.5
B     2.5
C     3.5

### what to include in code:

name of df

groupby method

key that you are grouping by

function

##### This shows groupby as a method, to which you state the function to run

if you dont put the additional function, you won't get what you want

In [199]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [200]:
planets.orbital_period.median()

39.9795

In [201]:
planets.groupby('year')['orbital_period'].median()

year
1989     83.888000
1992     45.901950
1994     98.211400
1995      4.230785
1996     65.669700
1997     39.845000
1998     58.112890
1999    256.780000
2000    179.665000
2001    462.790000
2002    505.549000
2003    441.470000
2004     35.103500
2005     68.630000
2006    233.150000
2007    311.665000
2008    226.930000
2009    464.700000
2010     16.278350
2011     20.219180
2012     11.738714
2013     24.806000
2014     12.815900
Name: orbital_period, dtype: float64

so above we have grouped by year, and then taken the median value of orbital_period for each year

grouby creates an object

In [202]:
planets.groupby('method')

This is a pandas object

that means we can reference a column, and essentially index it

we can now see we have a series, from which we can fun our calculations

In [204]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [205]:

# You can expand to additional aggregate functions

planets.dropna().groupby('method')['distance'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Radial Velocity,497.0,51.814829,46.29828,1.35,24.15,39.56,59.28,354.0
Transit,1.0,178.000000,NaN,178.00,178.00,178.00,178.00,178.0

In [206]:
planets.groupby('method')['distance'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

In [207]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [208]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

We can also group by multiple variables

to do so we group by a list that contains all variables we want

In [209]:
planets.groupby(['method', 'number']).mean()

                                      orbital_period      mass     distance  \
method                        number
Astrometry                    1           631.180000       NaN    17.875000
Eclipse Timing Variations     1          5821.166667  5.125000          NaN
                              2          4216.883333       NaN   315.360000
Imaging                       1        140621.606250       NaN    71.683929
                              4         73500.000000       NaN    39.940000
Microlensing                  1          3030.000000       NaN  4160.000000
                              2          3462.500000       NaN  4080.000000
Orbital Brightness Modulation 1             1.544929       NaN          NaN
                              2             0.291496       NaN  1180.000000
Pulsar Timing                 1         18262.545353       NaN  1200.000000
                              3            63.338433       NaN          NaN
Pulsation Timing Variations   1          1170.000000       NaN          NaN
Radial Velocity               1           814.143794  3.323939    60.648243
                              2           959.022946  2.229547    49.316190
                              3           769.421724  0.916872    30.302308
                              4           695.769616  0.986492     9.930000
                              5          1045.993508  1.166750    12.530000
                              6           213.752357  0.038556    19.673333
Transit                       1            12.301023  1.470000   584.836460
                              2            27.589652       NaN   924.142857
                              3            22.187586       NaN   481.007143
                              4            21.430775       NaN          NaN
                              5            30.584464       NaN   320.333333
                              6            40.513600       NaN   613.000000
                              7           119.217898       NaN   780.000000
Transit Timing Variations     2            79.783500       NaN  1104.333333
                              3                  NaN       NaN          NaN

                                             year
method                        number
Astrometry                    1       2011.500000
Eclipse Timing Variations     1       2010.666667
                              2       2009.666667
Imaging                       1       2009.205882
                              4       2008.500000
Microlensing                  1       2009.736842
                              2       2010.000000
Orbital Brightness Modulation 1       2013.000000
                              2       2011.000000
Pulsar Timing                 1       2007.000000
                              3       1992.666667
Pulsation Timing Variations   1       2007.000000
Radial Velocity               1       2007.082317
                              2       2008.219697
                              3       2008.886792
                              4       2003.823529
                              5       2004.000000
                              6       2010.777778
Transit                       1       2010.282927
                              2       2012.375000
                              3       2011.870968
                              4       2013.272727
                              5       2012.080000
                              6       2010.000000
                              7       2013.000000
Transit Timing Variations     2       2012.000000
                              3       2014.000000

### Pivot Tables

pivot tables are a lot like using groupby - so much so that it can be hard to tell the difference

examples

In [210]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [211]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [212]:
# We could also group by multiple variables by making a list


titanic.groupby(['sex', 'class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [213]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### This all gets a little unweildy, so Pandas has the pivot_table

In [214]:
titanic.pivot_table('survived', index = 'sex', columns = 'class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [215]:
titanic.pivot_table('survived', 'sex', 'class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [216]:
titanic.pivot_table('survived', 'class', 'sex')

sex       female      male
class
First   0.968085  0.368852
Second  0.921053  0.157407
Third   0.500000  0.135447

and we can make this multidimensional by adding multiple rows or columns if we use lists

In [218]:
# average age of people who survived or died

titanic.pivot_table('age',['sex', 'survived'], 'class')

class                First     Second      Third
sex    survived
female 0         25.666667  36.000000  23.818182
       1         34.939024  28.080882  19.329787
male   0         44.581967  33.369048  27.255814
       1         36.248000  16.022000  22.274211

In [219]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

There is a whole lot more that can be done with pivot tables

the aggfunc keyword allows you to control which functions are run

what is happening in the following code?

In [220]:
titanic.pivot_table(index = 'sex', columns = 'class',
                    aggfunc = {'survived':sum, 'fare': 'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47